app/views/users/show.html.erb

          <!--2018/05/05 ADD(S) HFUJIYOS-->
          <%  current_user.reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 1