app/controllers/reviews_controller.rb

  def create
    # Review.create(create_params)
    # トップページにリダイレクトする
    # 2018/05/04 ADD(S) HFUJIYOS
    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('hfujiyos', 7, '絵柄が可愛いですね。', 2, '2018-05-04 10:34:13', '2018-05-04 10:34:13')