app/views/products/index.html.erb

                        <span class="rating-star">
                          <% if product.reviews.present? %>
                            <!--2018/05/05 UPD(S) HFUJIYOS-->
                            <!--<i class="star-actived rate-<%= product.reviews.average(:rate).round %>0"></i>-->
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
SELECT AVG(`reviews`.`rate`) FROM `reviews` WHERE `reviews`.`product_id` = 1