app/views/products/show.html.erb

                <!--</li>-->
                <% @product.reviews.each do |review| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1